In [1]:
import pandas as pd

iris = pd.read_csv('dataset.csv')
iris

    nombre  edad      ciudad
0    Alice    30  Nueva York
1      Bob    25     Londres
2  Charlie    35       París

In [2]:
iris.head()

    nombre  edad      ciudad
0    Alice    30  Nueva York
1      Bob    25     Londres
2  Charlie    35       París

In [3]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  3 non-null      object
 1   edad    3 non-null      int64
 2   ciudad  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [5]:
iris.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [7]:
iris['nombre'].value_counts()

nombre
Alice      1
Bob        1
Charlie    1
Name: count, dtype: int64